InformationRegisters/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтавкиНДС</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/КЛАДОСлужебныйПовтИсп/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция СтавкаНДСОрганизации(Организация = Неопределено, ПериоД = Неопределено) Экспорт
	
	Если Организация = Неопределено Тогда
		Организация = ОрганизацияПоУмолчанию();
	КонецЕсли;
	Если ПериоД = Неопределено Тогда
		ПериоД = Дата(1,1,1);
	КонецЕсли;
	Выборка = РегистрыСведений.СтавкиНДС.Выбрать(,Период, Новый Структура("Организация", Организация));;
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ставка
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ОрганизацияПоУмолчанию() Экспорт
	
	Возврат Константы.ОрганизацияПоУмолчанию.Получить();
	
КонецФункции

Функция ТекущийСотрудник() Экспорт
	
	Возврат Пользователи.ТекущийПользователь().Сотрудник;
	
КонецФункции

#КонецОбласти
